import random

menu = [
    '반계장', '육개장', '라면공기밥세트', '쫄면', '떡라면', '카레치즈라면', '돈까스김치나베',
    '알김치돌솥밥', '짬봉', '만두백반', '치즈라면', '라면', '김치찌개', '물냉면', '떡만두라면',
    '만두라면', '라볶이', '비빔냉면', '어묵우동', '떡치즈라면', '땡초라면', '치즈돈까스','짜장면',
    '고구마치즈돈까스', '치킨마요덮밥', '짜장돈까스', '떡볶이', '비빔돈까스', '돈까스', '참치마요덮밥',
    '짜장탕수육세트', '고추장계란밥', '짬뽕탕수육세트', '탕수육덮밥', '제육덮밥', '간장계란밥', '짜장덮밥',
    '계란후라이', '공기밥', '탕수육'
]

print("==========","메뉴","===========")
for i in range(len(menu)) :
    print(menu[i])
print("===============================")

print()

i = random.randint(0,len(menu))
print('추천 메뉴:', menu[i])
print('추천 메뉴:', menu[i+1])
print('추천 메뉴:', menu[i+2])
print('추천 메뉴:', menu[i+3])
print('추천 메뉴:', menu[i+4])
