with open("c:/data/menu.txt", 'w') as f: # 파일 객체 생성, with라 close 안해도 됨
    menu1 = {
        # 한식
        "한식": {
            "반계탕": 5500,
            "육개장": 5000,
            "돈까스김치나베": 5000,
            "알김치돌솥밥": 5000,
            "김치찌개": 5000,
        }
    }
        # 분식
    menu2 = {
        "분식": {
            "비빔돈까스": 6000,
            "돈까스": 5500,
            "치즈돈까스": 6000,
            "참치마요덮밥": 5000,
            "짜장탕수육세트": 5500,
            "고추장계란밥": 4500,
            "짜장면": 4500,
            "짬뽕탕수육세트": 5500,
            "탕수덮밥": 5000,
            "제육덮밥": 5500,
            "간장계란밥": 4500,
            "짜장덮밥": 5000,
        }
    }
        # 면류
    menu3 = {
        "면류": {
            "라면": 3500,
            "쫄면": 4000,
            "떡라면": 3800,
            "카레치즈라면": 4000,
            "짬뽕": 4500,
            "만두백반": 4500,
            "치즈라면": 3800,       
            "물냉면": 5000,
            "떡만두라면": 4000,
            "만두라면": 3800,
            "라볶이": 5500,
        }
    }

        # 추가
    add = {
        "추가": {
            "계란후라이": 500,
        }
    }